{"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "nb_filters": 61, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 64, 6]}, "name": "tcn", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "batch_normalization", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "max_pooling1d", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 32, 61]}, "name": "flatten", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 34, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1952]}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 34, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1952]}, "name": "dense_1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": null, "class_name": "Sampling", "config": {"name": "sampling", "trainable": true, "dtype": "float32"}, "registered_name": "Sampling", "build_config": {"input_shape": [[null, 34], [null, 34]]}, "name": "sampling", "inbound_nodes": [[["dense", 0, 0, {}], ["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0], ["dense_1", 0, 0], ["sampling", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [null, 64, 6]}, "name": "model", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "registered_name": null, "name": "input_2", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1952, "activation": "selu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 34]}, "name": "dense_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [32, 61]}, "registered_name": null, "build_config": {"input_shape": [null, 1952]}, "name": "reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d", "trainable": true, "dtype": "float32", "size": 2}, "registered_name": null, "build_config": {"input_shape": [null, 32, 61]}, "name": "up_sampling1d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "batch_normalization_1", "inbound_nodes": [[["up_sampling1d", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_1", "trainable": true, "dtype": "float32", "nb_filters": 61, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 64, 61]}, "name": "tcn_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "conv1d", "inbound_nodes": [[["tcn_1", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv1d", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [null, 34]}, "name": "model_1", "inbound_nodes": [[["model", 1, 2, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "nb_filters": 61, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 64, 6]}, "name": "tcn", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "batch_normalization", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 61]}, "name": "max_pooling1d", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 32, 61]}, "name": "flatten", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 34, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1952]}, "name": "dense_1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": []}, "name": "tf.__operators__.add", "inbound_nodes": [["_CONSTANT_VALUE", -1, 1.0, {"y": ["dense_1", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.exp", "trainable": true, "dtype": "float32", "function": "math.exp"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 34]}, "name": "tf.math.exp", "inbound_nodes": [["dense_1", 0, 0, {}]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 34, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1952]}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.subtract", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 34]}, "name": "tf.math.subtract", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"y": ["tf.math.exp", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.square", "trainable": true, "dtype": "float32", "function": "math.square"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 34]}, "name": "tf.math.square", "inbound_nodes": [["dense", 0, 0, {"name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_1", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 34]}, "name": "tf.math.subtract_1", "inbound_nodes": [["tf.math.subtract", 0, 0, {"y": ["tf.math.square", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 34]}, "name": "tf.math.reduce_sum", "inbound_nodes": [["tf.math.subtract_1", 0, 0, {"axis": -1, "keepdims": false}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": []}, "name": "tf.math.multiply", "inbound_nodes": [["_CONSTANT_VALUE", -1, -0.8873361945152283, {"y": ["tf.math.reduce_sum", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null]}, "name": "tf.math.reduce_mean", "inbound_nodes": [["tf.math.multiply", 0, 0, {"axis": null, "keepdims": false}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.truediv", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": []}, "name": "tf.math.truediv", "inbound_nodes": [["tf.math.reduce_mean", 0, 0, {"y": 384, "name": null}]]}, {"module": "keras.src.engine.base_layer", "class_name": "AddLoss", "config": {"name": "add_loss", "trainable": true, "dtype": "float32", "unconditional": false}, "registered_name": "AddLoss", "build_config": {"input_shape": []}, "name": "add_loss", "inbound_nodes": [[["tf.math.truediv", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["model_1", 1, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}